# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/services"

# formulaes
brew "bat"
brew "mas"
brew "ollama", restart_service: true
brew "openjdk@17"
brew "telnet"
brew "wget"
brew "yarn"

# casks
cask "appcleaner"
cask "c0re100-qbittorrent"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keka"
cask "mediamate"
cask "miniconda"
cask "mongodb-compass"
cask "motrix"
cask "neteasemusic"
cask "obsidian"
cask "orbstack"
cask "outline-manager"
cask "playcover-community"
cask "plex-media-server"
cask "raycast"
cask "shadowsocksx-ng"
cask "steam"
cask "tencent-lemon"
cask "visual-studio-code"
cask "vmware-fusion"
cask "wechat"

# app store apps
mas "Infuse", id: 1136220934
mas "Keynote", id: 409183694
mas "LocalSend", id: 1661733229
mas "Outline", id: 1356178125
mas "Spark", id: 1176895641
mas "Xnip", id: 1221250572

# vscode exts
vscode "amodio.tsl-problem-matcher"
vscode "antfu.browse-lite"
vscode "antfu.iconify"
vscode "antfu.icons-carbon"
vscode "antfu.slidev"
vscode "antfu.theme-vitesse"
vscode "antfu.unocss"
vscode "antfu.vite"
vscode "antfu.where-am-i"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "drknoxy.eslint-disable-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "file-icons.file-icons"
vscode "hediet.vscode-drawio"
vscode "jock.svg"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "naumovs.color-highlight"
vscode "richie5um2.vscode-sort-json"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "tabbyml.vscode-tabby"
vscode "unional.vscode-sort-package-json"
vscode "usernamehw.errorlens"
vscode "vue.volar"
vscode "wakatime.vscode-wakatime"
